NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_timer_scheduler.c
    m_cb_count = 0;
    /* reschedule unscheduled */
    timer_sch_reschedule(&evts[0], 1600);
    m_time_now = 1600;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(1, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_UNUSED, evts[0].state);

    /* reschedule unscheduled, should have fired already. */
    timer_sch_reschedule(&evts[0], 1400);
    m_time_now = 1700;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(2, m_cb_count);
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_UNUSED, evts[0].state);

    m_cb_count = 0;
    /* reschedule, change order (later) */
    timer_sch_schedule(&evts[1]);
    timer_sch_schedule(&evts[2]);
    timer_sch_reschedule(&evts[1], 3500); /* go past evt[2] */
    m_time_now = 2000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(0, m_cb_count); /* no change */
    m_time_now = 3000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(1, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);
    m_time_now = 3500;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(2, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);

    m_cb_count = 0;
    /* reschedule, change order (earlier) */
    timer_sch_schedule(&evts[3]);
    timer_sch_schedule(&evts[4]);
    timer_sch_reschedule(&evts[4], 3700); /* go before evt[3] */
    m_time_now = 3700;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(1, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);
    m_time_now = 4000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(2, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);

    m_cb_count = 0;
    /* reschedule race condition (earlier) */
    m_async_exec = true;
    timer_sch_schedule(&evts[5]);
    timer_sch_schedule(&evts[6]);
    timer_sch_reschedule(&evts[6], 4500); /* go before evt[5] */
    exec_async();
    m_time_now = 4500;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(0, m_cb_count); /* unchanged */
    exec_async(); /* do reschedule */
    TEST_ASSERT_EQUAL(1, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);
    m_time_now = 6000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(1, m_cb_count); /* unchanged */
    exec_async(); /* execute fire */
    TEST_ASSERT_EQUAL(2, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);

    m_cb_count = 0;
    /* reschedule race condition (later) */
    m_async_exec = true;
    timer_sch_schedule(&evts[7]);
    timer_sch_schedule(&evts[8]);
    timer_sch_reschedule(&evts[7], 9500); /* go past evt[8] */
    exec_async();
    m_time_now = 8000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(0, m_cb_count); /* unchanged */
    exec_async(); /* do reschedule */
    TEST_ASSERT_EQUAL(0, m_cb_count); /* unchanged */
    m_time_now = 9000;
    m_timer_cb(m_time_now);
    exec_async(); /* execute fire */
    TEST_ASSERT_EQUAL(1, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);
    m_time_now = 9500;
    m_timer_cb(m_time_now);
    exec_async(); /* execute fire */
    TEST_ASSERT_EQUAL(2, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);

    m_cb_count = 0;
    /* reschedule on full queue, don't stop execution */
    m_async_exec = false;
    m_ret_val = NRF_ERROR_NO_MEM;
    timer_sch_reschedule(&evts[1], 4000);
    m_ret_val = NRF_SUCCESS;
    timer_sch_schedule(&evts[2]);
    m_time_now = 5000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(2, m_cb_count);

    /* reschedule while in add-queue */
    m_async_exec = true;
    m_time_now = 0;
    timer_sch_schedule(&evts[0]);
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_ADDED, evts[0].state);
    timer_sch_reschedule(&evts[0], 10000);
    /* No change to state, we just adjusted the time */
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_ADDED, evts[0].state);
    exec_async();
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_QUEUED, evts[0].state);
}

void test_timer_sch_periodic(void)
{
    timer_event_t evts[3];
    for (uint32_t i = 0; i < 3; i++)
    {
        evts[i].cb = timer_sch_cb;
        evts[i].timestamp = (i + 1) * 1000;
        evts[i].interval = 1100;
        evts[i].state = TIMER_EVENT_STATE_UNUSED;
    }
    timer_sch_schedule(&evts[0]);
    TEST_ASSERT_EQUAL(1000, m_last_timer_order);
    m_time_now = 1000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(1, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);
    TEST_ASSERT_EQUAL(2100, evts[0].timestamp);
    m_time_now = 2100;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(2, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);
    TEST_ASSERT_EQUAL(3200, evts[0].timestamp);

    timer_sch_schedule(&evts[2]);
    m_time_now = 3000;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(3, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);
    TEST_ASSERT_EQUAL(4100, evts[2].timestamp);

    m_time_now = 3200;
    m_timer_cb(m_time_now);
    TEST_ASSERT_EQUAL(4, m_cb_count);
    TEST_ASSERT_EQUAL(m_time_now, m_last_timestamp);
    TEST_ASSERT_EQUAL(4300, evts[0].timestamp);
}

void test_abort_self_from_callback(void)
{
    /* Lots of recursion here if we execute the calls inline. On target, calling
     * bearer_event_flag_set() from bearer_event context will trigger the call later, so we'll set
     * async execution to mimic this behavior: */
    m_async_exec = true;
    timer_event_t evts[3];
    for (uint32_t i = 0; i < 3; i++)
    {
        evts[i].cb = timer_sch_cb;
        evts[i].timestamp = (i + 1) * 1000;
        evts[i].interval = 10000;
        evts[i].state = TIMER_EVENT_STATE_UNUSED;
        evts[i].p_context = &evts[i];
    }

    /* Make the timer call abort on itself from its own callback */
    evts[1].cb = timer_callback_call_abort;
    for (uint32_t i = 0; i < 3; i++)
    {
        timer_sch_schedule(&evts[i]);
        TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_ADDED, evts[i].state);
    }
    exec_async();
    for (uint32_t i = 0; i < 3; i++)
    {
        TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_QUEUED, evts[i].state);
    }

