NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_timer_scheduler.c
    m_cb_count = 0;
    for (uint32_t i = 0; i < 3; i++)
    {
        m_time_now = (i + 1) * 1000;
        m_timer_cb(m_time_now);
        exec_async();
    }
    TEST_ASSERT_FALSE(event_is_in_loop(&evts[1]));
    TEST_ASSERT_EQUAL(2, m_cb_count);
    /* evts[1] should have aborted itself successfully: */
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_UNUSED, evts[1].state);
    /* ensure that it's no longer in the list: */
    evts[1].cb = timer_sch_cb;
    for (uint32_t i = 0; i < 3; i++)
    {
        m_time_now = 10000 + (i + 1) * 1000;
        m_timer_cb(m_time_now);
        exec_async();
    }
    TEST_ASSERT_EQUAL(4, m_cb_count);

}

void test_abort_other_from_callback(void)
{
    m_async_exec = true;
    timer_event_t evts[3];
    for (uint32_t i = 0; i < 3; i++)
    {
        evts[i].cb = timer_sch_cb;
        evts[i].timestamp = (i + 1) * 1000;
        evts[i].interval = 10000;
        evts[i].state = TIMER_EVENT_STATE_UNUSED;
        evts[i].p_context = &evts[i];
    }

    /* Abort other timers from inside the callback */
    evts[1].cb = timer_callback_call_abort;
    evts[1].p_context = &evts[2];
    for (uint32_t i = 0; i < 3; i++)
    {
        timer_sch_schedule(&evts[i]);
        TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_ADDED, evts[i].state);
    }
    exec_async();
    for (uint32_t i = 0; i < 3; i++)
    {
        TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_QUEUED, evts[i].state);
    }

    m_cb_count = 0;
    for (uint32_t i = 0; i < 3; i++)
    {
        m_time_now = (i + 1) * 1000;
        m_timer_cb(m_time_now);
        exec_async();
    }
    TEST_ASSERT_FALSE(event_is_in_loop(&evts[1]));
    TEST_ASSERT_EQUAL(1, m_cb_count); /* evt 2 never got to fire */
    /* evts[2] should have been aborted successfully: */
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_UNUSED, evts[2].state);

    /* schedule evts[2] again, but make it fire right after evts[1] (in the same callback context) */
    evts[2].timestamp = evts[1].timestamp + 1;
    timer_sch_schedule(&evts[2]);
    exec_async();
    m_cb_count = 0;
    m_time_now = evts[1].timestamp;
    m_timer_cb(m_time_now);
    exec_async();
    TEST_ASSERT_EQUAL(1, m_cb_count); /* evt 2 never got to fire, as we aborted it right before */
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_UNUSED, evts[2].state);

    /* schedule evts[2] again, but make it fire right BEFORE evts[1] (in the same callback context) */
    evts[2].timestamp = evts[1].timestamp - 1;
    timer_sch_schedule(&evts[2]);
    exec_async();
    m_cb_count = 0;
    m_time_now = evts[1].timestamp;
    m_timer_cb(m_time_now);
    exec_async();
    TEST_ASSERT_EQUAL(2, m_cb_count); /* evt 2 got to fire, as we didn't abort it in time.  */
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_UNUSED, evts[2].state); /* its next interval was cancelled though. */
    TEST_ASSERT_FALSE(event_is_in_loop(&evts[2]));
}

void test_reschedule_self_from_callback(void)
{
    m_async_exec = true;
    timer_event_t evts[3];
    for (uint32_t i = 0; i < 3; i++)
    {
        evts[i].cb = timer_sch_cb;
        evts[i].timestamp = (i + 1) * 1000;
        evts[i].interval = 10000;
        evts[i].state = TIMER_EVENT_STATE_UNUSED;
        evts[i].p_context = &evts[i];
    }

    /* Make the timer call reschedule on itself from its own callback */
    evts[1].cb = timer_callback_call_reschedule;
    for (uint32_t i = 0; i < 3; i++)
    {
        timer_sch_schedule(&evts[i]);
        TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_ADDED, evts[i].state);
    }
    exec_async();
    for (uint32_t i = 0; i < 3; i++)
    {
        TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_QUEUED, evts[i].state);
    }
    m_cb_count = 0;
    for (uint32_t i = 0; i < 3; i++)
    {
        m_time_now = (i + 1) * 1000;
        m_timer_cb(m_time_now);
        exec_async();
    }
    TEST_ASSERT_EQUAL(2, m_cb_count);
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_QUEUED, evts[1].state);
    TEST_ASSERT_EQUAL(6000, evts[1].timestamp);
    TEST_ASSERT_FALSE(event_is_in_loop(&evts[1]));
}

void test_reschedule_self_earlier_from_callback(void)
{
    m_async_exec = true;
    timer_event_t evts[3];
    for (uint32_t i = 0; i < 3; i++)
    {
        evts[i].cb = timer_sch_cb;
        evts[i].timestamp = (i + 1) * 1000;
        evts[i].interval = 10000;
        evts[i].state = TIMER_EVENT_STATE_UNUSED;
        evts[i].p_context = &evts[i];
    }

    /* Make the timer call reschedule on itself to an earlier time from its own callback */
    evts[1].cb = timer_callback_call_reschedule_earlier;
    for (uint32_t i = 0; i < 3; i++)
    {
        timer_sch_schedule(&evts[i]);
        TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_ADDED, evts[i].state);
    }
    exec_async();
    for (uint32_t i = 0; i < 3; i++)
    {
        TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_QUEUED, evts[i].state);
    }
    m_cb_count = 0;
    /* the first timer will fire normally */
    m_time_now = 1000;
    m_timer_cb(m_time_now);
    exec_async();
    /* the second timer will fire, reschedule itself to an earlier time, fire again with the earlier
     * time, and add its own interval, ending up at T = 2000 - 4000 + 10000 = 8000 */
    m_time_now = 2000;
    m_timer_cb(m_time_now);
    exec_async();
    /* The third timer will fire normally */
    m_time_now = 3000;
    m_timer_cb(m_time_now);
    exec_async();
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_QUEUED, evts[1].state); /* ready for next interval */
    TEST_ASSERT_EQUAL(3, m_cb_count); /* the "earlier" call was to the normal callback */
    TEST_ASSERT_EQUAL(8000, evts[1].timestamp);
    TEST_ASSERT_FALSE(event_is_in_loop(&evts[1]));
}

void test_reschedule_other_from_callback(void)
{
    m_async_exec = true;
    timer_event_t evts[3];
    for (uint32_t i = 0; i < 3; i++)
    {
        evts[i].cb = timer_sch_cb;
        evts[i].timestamp = (i + 1) * 1000;
        evts[i].interval = 10000;
        evts[i].state = TIMER_EVENT_STATE_UNUSED;
        evts[i].p_context = &evts[i];
    }

    /* Make the timer reschedule an other event from its callback */
    evts[1].cb = timer_callback_call_reschedule;
    evts[1].p_context = &evts[2];
    for (uint32_t i = 0; i < 3; i++)
    {
        timer_sch_schedule(&evts[i]);
        TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_ADDED, evts[i].state);
    }
    exec_async();
    for (uint32_t i = 0; i < 3; i++)
    {
        TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_QUEUED, evts[i].state);
    }
    m_cb_count = 0;
    for (uint32_t i = 0; i < 3; i++)
    {
        m_time_now = (i + 1) * 1000;
        m_timer_cb(m_time_now);
        exec_async();
    }
    TEST_ASSERT_EQUAL(1, m_cb_count);
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_QUEUED, evts[2].state);
    TEST_ASSERT_EQUAL(6000, evts[2].timestamp);
    TEST_ASSERT_FALSE(event_is_in_loop(&evts[1]));
    TEST_ASSERT_FALSE(event_is_in_loop(&evts[2]));
}

