NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_timer_scheduler.c
void test_reschedule_other_earlier_from_callback(void)
{
    m_async_exec = true;
    timer_event_t evts[3];
    for (uint32_t i = 0; i < 3; i++)
    {
        evts[i].cb = timer_sch_cb;
        evts[i].timestamp = (i + 1) * 1000;
        evts[i].interval = 10000;
        evts[i].state = TIMER_EVENT_STATE_UNUSED;
        evts[i].p_context = &evts[i];
    }

    /* Make the timer reschedule an other event to an earlier time from its own callback */
    evts[1].cb = timer_callback_call_reschedule_earlier;
    evts[1].p_context = &evts[2];
    for (uint32_t i = 0; i < 3; i++)
    {
        timer_sch_schedule(&evts[i]);
        TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_ADDED, evts[i].state);
    }
    exec_async();
    for (uint32_t i = 0; i < 3; i++)
    {
        TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_QUEUED, evts[i].state);
    }
    m_cb_count = 0;
    /* the first timer will fire normally */
    m_time_now = 1000;
    m_timer_cb(m_time_now);
    exec_async();
    /* the second timer will fire, reschedule the third timer to an earlier time, fire that timer
     * with the earlier time, and add its interval, ending up at T = 2000 - 4000 + 10000 = 8000 for
     * evt[2]. */
    m_time_now = 2000;
    m_timer_cb(m_time_now);
    exec_async();
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_QUEUED, evts[1].state); /* ready for next interval */
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_QUEUED, evts[2].state); /* ready for next interval */
    TEST_ASSERT_EQUAL(2, m_cb_count);
    TEST_ASSERT_EQUAL(12000, evts[1].timestamp); /* normal */
    TEST_ASSERT_EQUAL(8000, evts[2].timestamp);
    /* firing at evt[2]'s original timestamp doesn't do anything: */
    m_time_now = 3000;
    m_timer_cb(m_time_now);
    exec_async();
    TEST_ASSERT_EQUAL(2, m_cb_count); /* unchanged */
}

void test_schedule_self_from_callback(void)
{
    m_async_exec = true;
    timer_event_t evts[3];
    for (uint32_t i = 0; i < 3; i++)
    {
        evts[i].cb = timer_sch_cb;
        evts[i].timestamp = (i + 1) * 1000;
        evts[i].interval = 10000;
        evts[i].state = TIMER_EVENT_STATE_UNUSED;
        evts[i].p_context = &evts[i];
    }

    /* Make the timer call schedule on itself from its own callback */
    evts[1].cb = timer_callback_call_schedule;
    for (uint32_t i = 0; i < 3; i++)
    {
        timer_sch_schedule(&evts[i]);
        TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_ADDED, evts[i].state);
    }
    exec_async();
    for (uint32_t i = 0; i < 3; i++)
    {
        TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_QUEUED, evts[i].state);
    }
    m_cb_count = 0;
    for (uint32_t i = 0; i < 3; i++)
    {
        m_time_now = (i + 1) * 1000;
        m_timer_cb(m_time_now);
        exec_async();
    }
    TEST_ASSERT_EQUAL(2, m_cb_count);
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_QUEUED, evts[1].state);
    TEST_ASSERT_EQUAL(6000, evts[1].timestamp);
}

void test_schedule_other_from_callback(void)
{
    m_async_exec = true;
    timer_event_t evts[3];
    for (uint32_t i = 0; i < 3; i++)
    {
        evts[i].cb = timer_sch_cb;
        evts[i].timestamp = (i + 1) * 1000;
        evts[i].interval = 10000;
        evts[i].state = TIMER_EVENT_STATE_UNUSED;
        evts[i].p_context = &evts[i];
    }

    /* Make the timer schedule an other event from its callback */
    evts[1].cb = timer_callback_call_schedule;
    evts[1].p_context = &evts[2];
    for (uint32_t i = 0; i < 3; i++)
    {
        timer_sch_schedule(&evts[i]);
        TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_ADDED, evts[i].state);
    }
    exec_async();
    for (uint32_t i = 0; i < 3; i++)
    {
        TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_QUEUED, evts[i].state);
    }
    m_cb_count = 0;
    /* the first timer will fire normally */
    m_time_now = 1000;
    m_timer_cb(m_time_now);
    exec_async();
    /* In the second, we'll attempt to schedule an event that's already scheduled. This causes a
     * hardfault when attempting to add it to the add-list. */
    m_time_now = 2000;
    m_timer_cb(m_time_now);
    TEST_NRF_MESH_ASSERT_EXPECT(exec_async());

    TEST_ASSERT_EQUAL(1, m_cb_count);
    TEST_ASSERT_EQUAL(TIMER_EVENT_STATE_QUEUED, evts[2].state); /* still queued. */
}

